[
  {
    "front": "What is myopia?",
    "back": "The human eye's inability to focus on distant objects due to an elongated eyeball."
  },
  {
    "front": "How does accommodation work in the eye?",
    "back": "It adjusts the focal length of the eye lens to focus on objects at different distances."
  },
  {
    "front": "What is myopia caused by?",
    "back": "An elongated eyeball that causes distant objects to be focused before the retina."
  },
  {
    "front": "How can myopia be corrected?",
    "back": "With a concave lens."
  },
  {
    "front": "What is hypermetropia?",
    "back": "The human eye's inability to focus on nearby objects due to an eyeball that is too small or a cornea that is too flat."
  },
  {
    "front": "How does hypermetropia differ from myopia?",
    "back": "It affects near vision rather than far vision."
  },
  {
    "front": "What can correct hypermetropia?",
    "back": "A convex lens."
  },
  {
    "front": "What is presbyopia?",
    "back": "The loss of the eye's power of accommodation with age, making it difficult to focus on nearby objects."
  },
  {
    "front": "What causes presbyopia?",
    "back": "The natural aging process of the eye."
  },
  {
    "front": "How can presbyopia be corrected?",
    "back": "With reading glasses or bifocal lenses."
  },
  {
    "front": "What is the primary effect of myopia on vision?",
    "back": "Difficulty focusing on distant objects."
  },
  {
    "front": "Which refractive defect affects near vision?",
    "back": "Hypermetropia."
  },
  {
    "front": "As a person ages, what happens to their accommodation?",
    "back": "It decreases due to presbyopia."
  },
  {
    "front": "What is the primary effect of hypermetropia on vision?",
    "back": "Difficulty focusing on nearby objects."
  },
  {
    "front": "Which refractive defect affects far vision?",
    "back": "Myopia."
  },
  {
    "front": "How do myopia and presbyopia affect vision differently?",
    "back": "Myopia affects far vision, while presbyopia affects near vision."
  },
  {
    "front": "What is the primary cause of myopia?",
    "back": "An elongated eyeball."
  },
  {
    "front": "What is the primary cause of hypermetropia?",
    "back": "An eyeball that is too small or a cornea that is too flat."
  },
  {
    "front": "How do reading glasses correct presbyopia?",
    "back": "By providing magnification to compensate for decreased accommodation."
  },
  {
    "front": "What is the primary effect of hypermetropia on daily life?",
    "back": "Difficulty with everyday tasks such as reading and driving."
  },
  {
    "front": "How does myopia affect daily life?",
    "back": "Difficulty with activities that require distant vision, such as watching TV or driving."
  },
  {
    "front": "What is the primary difference between myopia and hypermetropia?",
    "back": "The direction of the refractive error (myopia affects far vision, while hypermetropia affects near vision)."
  },
  {
    "front": "How can presbyopia be managed?",
    "back": "With the use of reading glasses or bifocal lenses."
  },
  {
    "front": "What is the long-term effect of untreated myopia?",
    "back": "Potential development of secondary conditions such as cataracts or glaucoma."
  },
  {
    "front": "How does hypermetropia affect daily life in children?",
    "back": "Difficulty with reading and writing, potentially impacting academic performance."
  },
  {
    "front": "What is the primary cause of presbyopia in individuals under 40 years old?",
    "back": "Other factors such as eye strain or dryness rather than natural aging."
  },
  {
    "front": "How can hypermetropia be managed in children?",
    "back": "With the use of corrective lenses, such as glasses or contacts."
  },
  {
    "front": "What is the primary effect of myopia on daily life?",
    "back": "Difficulty with activities that require distant vision, such as watching TV or driving."
  },
  {
    "front": "How does presbyopia affect daily life in older adults?",
    "back": "Difficulty with everyday tasks such as reading and writing, potentially impacting independence."
  }
]